yngrk/hoihoi-assistant/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# --- Flash: 16 MB, QIO @ 80 MHz ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# --- Partitionstabelle ---
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- PSRAM: 8 MB im Octal-Modus @ 80 MHz (das "R8" in N16R8) ---
# Ohne diese drei Zeilen bleiben nur ~320 KB internes RAM und der
# 400x300-Framebuffer laesst sich nicht allozieren.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y

# --- Konsole: UART0 primaer, zusaetzlich ueber nativen USB (COM6) ---
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- CPU-Takt: 240 MHz statt der IDF-Vorgabe von 160 MHz ---
# Der S3 kann 240 MHz. Fuer den Bring-up war der Unterschied egal, fuer die
# Audioverarbeitung (Mikrofon, Keyword-Erkennung) ist er es nicht.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# --- Bluetooth LE, ausschliesslich fuer die WLAN-Bereitstellung ---
# NimBLE statt Bluedroid: deutlich kleiner, und mehr als GATT braucht der
# Bereitstellungsdienst nicht. Klassisches Bluetooth kann der S3 ohnehin
# nicht. Der Stack wird nach getaner Arbeit wieder freigegeben.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=n

# --- mbedTLS: Sende- und Empfangspuffer nur waehrend der Uebertragung ---
# Eine TLS-Sitzung legt sonst dauerhaft 16 KB Empfangs- und 4 KB Sendepuffer
# im *internen* Speicher an, auch wenn nichts laeuft. Drei Sitzungen
# gleichzeitig — die Erkennung ueber WebSocket, die Antwort und die Stimme —
# waren damit 60 KB, und der Bildpuffer bekam bei jedem Bild seine 15 KB
# nicht mehr: "Failed to allocate priv TX buffer", ESP_ERROR_CHECK, Neustart.
# Mit dieser Zeile hoelt mbedTLS die Puffer beim Senden und Empfangen und
# gibt sie danach wieder her.
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y

# --- ... und diese Puffer aus dem PSRAM ---
# Geholt wurden sie trotzdem im internen Speicher, und dort liegen waehrend
# einer Antwort nur noch gut 50 KB frei, zerstueckelt vom offenen Wandler. In
# der ersten Runde mit KI brach bei jeder Antwort einmal eine Verbindung ab:
#
#   Dynamic Impl: alloc(16749 bytes) failed
#   esp-tls-mbedtls: read error :-0x7F00
#
# Traf es die Stimme, blieb die Ausgabe mitten im Satz stehen. Im PSRAM ist
# fuer diese Puffer reichlich Platz, und fuer 24 kHz Ton ist er schnell genug.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Laufzeitstatistik je Task. Gebraucht fuer den Stau-Melder in main.cpp: der
# Aufnahmetask auf Kern 1 stand mehrfach ueber eine Sekunde still, obwohl er
# mit Prioritaet 6 ueber allem liegt, was diese Firmware selbst anlegt. Wer
# ihn verdraengt, steht nur hier drin.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
